files/Start Point.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
<DataService version="2.0" xsi:schemaLocation="http://www.tibco.com/cim/services/mastercatalogrecord/wsdl/2.0 ..\..\..\MasterCatalogRecord_Action.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.tibco.com/cim/services/mastercatalogrecord/wsdl/2.0">
    <Identity>
        <DirectoryPath>
            <Directory type="Enterprise">PRODUCT</Directory>
            <Directory type="User">crms</Directory>
        </DirectoryPath>
        <Authentication>Crms@123</Authentication>
    </Identity>
    <Transaction>
        <!--The Supported CommandTypes for Save are Add and Modify-->
        <Command type="Add">
            <!--The Suppored commandqualifier for Save are Validate/Process, NoValidate/Process, default is Validate/Process-->
            <MasterCatalogRecord etype="Entity" commandqualifier="Validate/Process">
                <ExternalKeys>
                    <Key name="MASTERCATALOGNAME" type="string">CR_INFORMATION</Key>
                    <Key name="PRODUCTID" type="string">{CRNO}</Key>
                    <!-- <Key name="PRODUCTIDEXT" type="string">$(PRODUCTIDEXTENSION)</Key> -->
                </ExternalKeys>
                <EntityData>
                    <Attribute name="PRODUCTID" type="string">{CRNO}</Attribute>
                    <Attribute name="STATUS" type="string">Start of Config</Attribute>
                    <Attribute name="INFORMATION" type="string">MentionedLocation</Attribute>
                </EntityData>
            </MasterCatalogRecord>
        </Command>
    </Transaction>
</DataService>
   </soapenv:Body>
</soapenv:Envelope>
